#pragma once
// pdb_info.h
// 06-25-2006 Sven B. Schreiber
// sbs@orgon.com

// =================================================================
// PDB INTERFACE VERSIONS
// =================================================================

#define PDBIntv41         920924
#define PDBIntv50       19960502
#define PDBIntv50a      19970116
#define PDBIntv60       19970116
#define PDBIntv61       19980914
#define PDBIntv69       19990511
#define PDBIntv70Dep    20000406
#define PDBIntv70       20001102

#define PDBIntv         PDBIntv70

#define PDBIntvAlt      PDBIntv50
#define PDBIntvAlt2     PDBIntv60
#define PDBIntvAlt3     PDBIntv69

// =================================================================
// PDB IMPLEMENTATION VERSIONS
// =================================================================

#define PDBImpvVC2      19941610
#define PDBImpvVC4      19950623
#define PDBImpvVC41     19950814
#define PDBImpvVC50     19960307
#define PDBImpvVC98     19970604
#define PDBImpvVC70Dep  19990604
#define PDBImpvVC70     20000404

#define PDBImpv         PDBImpvVC70

// =================================================================
// DBI IMPLEMENTATION VERSIONS
// =================================================================

#define DBIImpvV41        930803
#define DBIImpvV50      19960307
#define DBIImpvV60      19970606
#define DBIImpvV70      19990903

#define DBIImpv         DBIImpvV70

// =================================================================

    CV_CALL_FAR_SYS         = 0x0000000A,
    CV_CALL_THISCALL        = 0x0000000B,
    CV_CALL_MIPSCALL        = 0x0000000C,
    CV_CALL_GENERIC         = 0x0000000D,
    CV_CALL_ALPHACALL       = 0x0000000E,
    CV_CALL_PPCCALL         = 0x0000000F,
    CV_CALL_SHCALL          = 0x00000010,
    CV_CALL_ARMCALL         = 0x00000011,
    CV_CALL_AM33CALL        = 0x00000012,
    CV_CALL_TRICALL         = 0x00000013,
    CV_CALL_SH5CALL         = 0x00000014,
    CV_CALL_M32RCALL        = 0x00000015,
    CV_CALL_RESERVED        = 0x00000016,
}
CV_call_e, *PCV_call_e, **PPCV_call_e;

// =================================================================
// POINTER TYPES
// =================================================================

typedef enum _CV_ptrtype_e
{
    CV_PTR_NEAR             = 0x00000000,
    CV_PTR_FAR              = 0x00000001,
    CV_PTR_HUGE             = 0x00000002,
    CV_PTR_BASE_SEG         = 0x00000003,
    CV_PTR_BASE_VAL         = 0x00000004,
    CV_PTR_BASE_SEGVAL      = 0x00000005,
    CV_PTR_BASE_ADDR        = 0x00000006,
    CV_PTR_BASE_SEGADDR     = 0x00000007,
    CV_PTR_BASE_TYPE        = 0x00000008,
    CV_PTR_BASE_SELF        = 0x00000009,
    CV_PTR_NEAR32           = 0x0000000A,
    CV_PTR_FAR32            = 0x0000000B,
    CV_PTR_64               = 0x0000000C,
    CV_PTR_UNUSEDPTR        = 0x0000000D,
}
CV_ptrtype_e, *PCV_ptrtype_e, **PPCV_ptrtype_e;

// =================================================================
// POINTER MODES
// =================================================================

typedef enum _CV_ptrmode_e
{
    CV_PTR_MODE_PTR         = 0x00000000,
    CV_PTR_MODE_REF         = 0x00000001,
    CV_PTR_MODE_PMEM        = 0x00000002,
    CV_PTR_MODE_PMFUNC      = 0x00000003,
    CV_PTR_MODE_RESERVED    = 0x00000004,
}
CV_ptrmode_e, *PCV_ptrmode_e, **PPCV_ptrmode_e;

// =================================================================
// ACCESS PROTECTION MODES
// =================================================================

typedef enum _CV_access_e
{
    CV_private              = 0x00000001,
    CV_protected            = 0x00000002,
    CV_public               = 0x00000003,
}
CV_access_e, *PCV_access_e, **PPCV_access_e;

// =================================================================
// METHOD PROPERTIES
// =================================================================

typedef enum _CV_methodprop_e
{
    CV_MTvanilla            = 0x0000,
    CV_MTvirtual            = 0x0001,
    CV_MTstatic             = 0x0002,
    CV_MTfriend             = 0x0003,
    CV_MTintro              = 0x0004,
    CV_MTpurevirt           = 0x0005,
    CV_MTpureintro          = 0x0006,
}
CV_methodprop_e, *PCV_methodprop_e, **PPCV_methodprop_e;

// =================================================================
// CODEVIEW STRUCTURES
// =================================================================

#pragma pack (1)

// -----------------------------------------------------------------

typedef struct _NB10I
{
    /*000*/ DWORD dwSig;
    /*004*/ DWORD dwOffset;
    /*008*/ DWORD sig;
    /*00C*/ DWORD age;
    /*010*/ BYTE  szPdb [MAX_PATH]; // PDB file name
    /*114*/ }
NB10I, *PNB10I, **PPNB10I;

#define NB10I_ sizeof (NB10I)

// -----------------------------------------------------------------

typedef struct _RSDSI
{
    /*000*/ DWORD dwSig;
    /*004*/ GUID  guidSig;
    /*014*/ DWORD age;
    /*018*/ BYTE  szPdb [3*MAX_PATH];
    /*324*/ }
RSDSI, *PRSDSI, **PPRSDSI;

#define RSDSI_ sizeof (RSDSI)

// -----------------------------------------------------------------

typedef union _CV
{
    /*000*/ DWORD dwSig;
    /*000*/ NB10I nb10i;
    /*000*/ RSDSI rsdsi;
    /*324*/ }
CV, *PCV, **PPCV;

#define CV_ sizeof (CV)

// -----------------------------------------------------------------

#pragma pack ()

// =================================================================
// MSF STRUCTURES
// =================================================================

#pragma pack (1)

// -----------------------------------------------------------------

typedef struct _SI_PERSIST
{
    /*000*/ LONG cb;      // number of bytes
    /*004*/ LONG mpspnpn;
    /*008*/ }
SI_PERSIST, *PSI_PERSIST, **PPSI_PERSIST;

#define SI_PERSIST_ sizeof (SI_PERSIST)

// -----------------------------------------------------------------

typedef struct _PG
{
    /*0000*/ BYTE rgb [0x1000]; // page data
    /*1000*/ }
PG, *PPG, **PPPG;

#define PG_ sizeof (PG)

// -----------------------------------------------------------------

typedef union _MSF_HDR
{
    struct
    {
        /*0000*/     BYTE       szMagic [0x2C];
        /*002C*/     LONG       cbPg;
        /*0030*/     WORD       pnFpm;
        /*0032*/     WORD       pnMac;
        /*0034*/     SI_PERSIST siSt;
        /*003C*/     WORD       mpspnpn [0x141];
        /*02BE*/     };
    /*0000*/ PG pg;
    /*1000*/ }
MSF_HDR, *PMSF_HDR, **PPMSF_HDR;

#define MSF_HDR_ sizeof (MSF_HDR)

// -----------------------------------------------------------------

typedef union _BIGMSF_HDR
{
    struct
    {
        /*0000*/     BYTE       szMagic [0x1E];
        /*001E*/     WORD       reserved;
        /*0020*/     LONG       cbPg;
        /*0024*/     DWORD      pnFpm;
        /*0028*/     DWORD      pnMac;
        /*002C*/     SI_PERSIST siSt;
        /*0034*/     DWORD      mpspnpnSt [0x49];
        /*0158*/     };
    /*0000*/ PG pg;
    /*1000*/ }
BIGMSF_HDR, *PBIGMSF_HDR, **PPBIGMSF_HDR;

#define BIGMSF_HDR_ sizeof (BIGMSF_HDR)

// -----------------------------------------------------------------

typedef struct _FPM
{
    /*000*/ DWORD   iwMac;
    /*004*/ DWORD   iwRover;
    /*008*/ LONG    cbPg;
    /*00C*/ BOOL    fBigMsf;
    /*00D*/ BYTE    reserved1; // padding
    /*00E*/ WORD    reserved2; // padding
    /*010*/ struct
        /*010*/     {
            /*010*/     DWORD rgt;
            /*014*/     DWORD itMac;
            /*018*/     DWORD itMax;
            /*01C*/     } rgw;
    /*01C*/ DWORD   wFill;
    /*020*/ }
FPM, *PFPM, **PPFPM;

#define FPM_ sizeof (FPM)

// -----------------------------------------------------------------

#pragma pack ()

// =================================================================
// PDB STRUCTURES (STREAM #1)
// =================================================================

#pragma pack (1)

// -----------------------------------------------------------------

#define GUID_SIG70 \
{0x33DED1D8, 0x5D57, 0x40D0, \
{0xA5, 0xE2, 0xF1, 0x71, 0x96, 0x98, 0x07, 0x21}}

// -----------------------------------------------------------------

typedef struct _PDBStream
{
    /*000*/ DWORD impv;
    /*004*/ DWORD sig;
    /*008*/ DWORD age;
    /*00C*/ }
PDBStream, *PPDBStream, **PPPDBStream;

#define PDBStream_ sizeof (PDBStream)

// -----------------------------------------------------------------

typedef struct _PDBStream70
{
    /*000*/ PDBStream pdbstream;
    /*00C*/ GUID      sig70;
    /*01C*/ }
PDBStream70, *PPDBStream70, **PPPDBStream70;

#define PDBStream70_ sizeof (PDBStream70)

// -----------------------------------------------------------------

#pragma pack ()

// =================================================================
// TPI STRUCTURES (STREAM #2)
//
// Contains information about symbol typing.
// There are fields in the records contained in $$SYMBOLS that index into the records contained
// in $$TYPES. Records in $$TYPES can also index into the records contained in the $$TYPES
// table.
// =================================================================

#pragma pack (1)

// -----------------------------------------------------------------
// Data location

struct TPI_LOCATION
{
    LONG lOffset;  // Offset of the data
    LONG cbSize;   // Size of the data
};

// -----------------------------------------------------------------
// TPI hash

struct TpiHash
{
    WORD  sn;            // stream #
    WORD  snPad;         // padding
    LONG  cbHashKey;
    LONG  cHashBuckets;
    TPI_LOCATION offcbHashVals;
    TPI_LOCATION offcbTiOff;
    TPI_LOCATION offcbHashAdj;
};

// -----------------------------------------------------------------
// TPI stream header
//

struct TPI_STREAM_HEADER
{
    DWORD   dwVersion;        // Implementation version
    LONG    cbHeader;         // Header size
    DWORD   dwMinTypeIndex;   // Type index base  (0x1000..0xFFFFFF)
    DWORD   dwMaxTypeIndex;   // Type index limit (0x1000..0xFFFFFF)
    DWORD   cbTypeRecords;    // Size of follow-up data
    struct TpiHash TpiHash;
};

// -----------------------------------------------------------------
// ???

typedef struct _OHDR
{
    BYTE  szMagic[0x2C];  // Magic string
    DWORD dwVersion;      // Implementation version
    DWORD dwSignature;    // Signature
    DWORD dwAge;          // File age
    WORD  dwMinTypeIndex; // Type index base
    WORD  dwMaxTypeIndex; // Type index limit
    LONG  cbSize;         // Size
}
OHDR, *POHDR, **PPOHDR;

// -----------------------------------------------------------------

typedef struct _CV_prop_t
{
    /*000.0*/ WORD packed   : 1;
    /*000.1*/ WORD ctor     : 1;
    /*000.2*/ WORD ovlops   : 1;
    /*000.3*/ WORD isnested : 1;
    /*000.4*/ WORD cnested  : 1;
    /*000.5*/ WORD opassign : 1;
    /*000.6*/ WORD opcast   : 1;
    /*000.7*/ WORD fwdref   : 1;
    /*001.0*/ WORD scoped   : 1;
    /*001.1*/ WORD reserved : 7;
    /*002*/ }
CV_prop_t, *PCV_prop_t, **PPCV_prop_t;

#define CV_prop_t_ sizeof (CV_prop_t)

// -----------------------------------------------------------------

typedef struct _CV_fldattr_t
{
    /*000.0*/ WORD access      : 2; // CV_access_e
    /*000.2*/ WORD mprop       : 3; // CV_methodprop_e
    /*000.5*/ WORD pseudo      : 1;
    /*000.6*/ WORD noinherit   : 1;
    /*000.7*/ WORD noconstruct : 1;
    /*001.0*/ WORD compgenx    : 1;
    /*001.1*/ WORD unused      : 7;
    /*002*/ }
CV_fldattr_t, *PCV_fldattr_t, **PPCV_fldattr_t;

#define CV_fldattr_t_ sizeof (CV_fldattr_t)

// -----------------------------------------------------------------

typedef struct _lfArray         // array
{
    /*000*/ WORD  leaf;             // LF_ARRAY
    /*002*/ DWORD elemtype;         // element type index
    /*006*/ DWORD idxtype;          // indexing type index
    /*00A*/ BYTE  data [1];          // size in bytes
    /*00A*/ }
lfArray, *PlfArray, **PPlfArray;

#define lfArray_ sizeof (lfArray)

// -----------------------------------------------------------------

typedef struct _lfBitfield      // bitfield structure
{
    /*000*/ WORD  leaf;             // LF_BITFIELD
    /*002*/ DWORD type;             // base type index
    /*006*/ BYTE  length;           // number of bits
    /*007*/ BYTE  position;         // bit offset of bit 0
    /*008*/ }
lfBitfield, *PlfBitfield, **PPlfBitfield;

#define lfBitfield_ sizeof (lfBitfield)

// -----------------------------------------------------------------

typedef struct _lfClass         // class or structure
{
    /*000*/ WORD      leaf;         // LF_CLASS, LF_STRUCTURE
    /*002*/ WORD      count;        // number of members
    /*004*/ CV_prop_t property;     // type properties
    /*006*/ DWORD     field;        // LF_FIELD descriptor index
    /*00A*/ DWORD     derived;
    /*00E*/ DWORD     vshape;
    /*012*/ BYTE      data [1];      // size and name
    /*012*/ }
lfClass, *PlfClass, **PPlfClass;

#define lfClass_ sizeof (lfClass)

// -----------------------------------------------------------------

typedef lfClass lfStructure, *PlfStructure, **PPlfStructure;
#define lfStructure_ sizeof (lfStructure)

// -----------------------------------------------------------------

typedef struct _lfUnion         // union
{
    /*000*/ WORD      leaf;         // LF_UNION
    /*002*/ WORD      count;        // number of members
    /*004*/ CV_prop_t property;     // type properties
    /*006*/ DWORD     field;        // LF_FIELD descriptor index
    /*00A*/ BYTE      data [1];      // size and name
    /*00A*/ }
lfUnion, *PlfUnion, **PPlfUnion;

#define lfUnion_ sizeof (lfUnion)

// -----------------------------------------------------------------

typedef struct _lfEnum          // enumeration
{
    /*000*/ WORD      leaf;         // LF_ENUM
    /*002*/ WORD      count;        // number of members
    /*004*/ CV_prop_t property;     // type properties
    /*006*/ DWORD     utype;        // underlying type
    /*00A*/ DWORD     field;        // LF_FIELD descriptor index
    /*00E*/ BYTE      Name [1];      // name
    /*00E*/ }
lfEnum, *PlfEnum, **PPlfEnum;

#define lfEnum_ sizeof (lfEnum)

// -----------------------------------------------------------------

typedef struct _lfPointer       // pointer to type
{
    /*000*/ struct lfPointerBody
        /*000*/     {
            /*000*/     WORD  leaf;         // LF_POINTER
            /*002*/     DWORD utype;        // underlying type
            /*006*/     struct lfPointerAttr
                /*006*/         {
                    /*006.0*/       DWORD ptrtype     :  5; // pointer type
                    /*006.5*/       DWORD ptrmode     :  3; // pointer mode
                    /*007.0*/       DWORD isflat32    :  1; // 0:32 pointer
                    /*007.1*/       DWORD isvolatile  :  1; // volatile pointer
                    /*007.2*/       DWORD isconst     :  1; // constant pointer
                    /*007.3*/       DWORD isunaligned :  1; // unaligned pointer
                    /*007.4*/       DWORD isrestrict  :  1; // restricted pointer
                    /*007.5*/       DWORD unused      : 19; // currently unused
                    /*00A*/         } attr;
            /*00A*/     };
    /*00A*/ union
        /*00A*/     {
            /*00A*/     struct
                /*00A*/         {
                    /*00A*/         DWORD pmclass;
                    /*00E*/         WORD  pmenum;
                    /*010*/         } pm;
            /*00A*/     WORD bseg;
            /*00A*/     BYTE Sym [1];
            /*00A*/     struct
                /*00A*/         {
                    /*00A*/         DWORD index;
                    /*00E*/         BYTE  name [1];
                    /*00E*/         } btype;
            /*010*/     } pbase;
    /*010*/ }
lfPointer, *PlfPointer, **PPlfPointer;

#define lfPointer_ sizeof (lfPointer)

// -----------------------------------------------------------------

typedef struct _lfProc          // procedure
{
    /*000*/ WORD  leaf;             // LF_PROCEDURE
    /*002*/ DWORD rvtype;           // return value type
    /*006*/ BYTE  calltype;         // calling convention (CV_call_e)
    /*007*/ BYTE  reserved;         // currently not used
    /*008*/ WORD  parmcount;        // number of parameters
    /*00A*/ DWORD arglist;          // argument list type
    /*00E*/ }
lfProc, *PlfProc, **PPlfProc;

#define lfProc_ sizeof (lfProc)

// -----------------------------------------------------------------

typedef struct _lfMFunc         // member function
{
    WORD  leaf;             // LF_MFUNCTION
    DWORD rvtype;           // return value type
    DWORD classtype;        // containing class type
    DWORD thistype;         // this-pointer type
    BYTE  calltype;         // calling convention (CV_call_e)
    BYTE  reserved;         // currently not used
    WORD  parmcount;        // number of parameters
    DWORD arglist;          // argument list type
    LONG  thisadjust;       // this-adjuster
}
lfMFunc, *PlfMFunc, **PPlfMFunc;

#define lfMFunc_ sizeof (lfMFunc)

// -----------------------------------------------------------------

typedef struct _lfArgList       // procedure argument list
{
    WORD  leaf;             // LF_ARGLIST
    DWORD count;            // number of arguments
    DWORD arg [1];           // argument types
}
lfArgList, *PlfArgList, **PPlfArgList;

#define lfArgList_ sizeof (lfArgList)

// -----------------------------------------------------------------

typedef struct _lfVTShape       // virtual function table shape
{
    WORD leaf;              // LF_VTSHAPE
    WORD count;             // number of VFT entries
    BYTE desc [1];           // 4-bit descriptor list
}
lfVTShape, *PlfVTShape, **PPlfVTShape;

#define lfVTShape_ sizeof (lfVTShape)

// -----------------------------------------------------------------

#pragma pack(1)
typedef struct _lfEnumerate     // enumeration member
{
    WORD         leaf;      // LF_ENUMERATE
    CV_fldattr_t attr;
    BYTE         value [1];
}
lfEnumerate, *PlfEnumerate, **PPlfEnumerate;
#pragma pack()

#define lfEnumerate_ sizeof (lfEnumerate)

// -----------------------------------------------------------------

typedef struct _lfMember        // non-static data member
{
    WORD         leaf;      // LF_MEMBER
    CV_fldattr_t attr;
    DWORD        index;
    BYTE         offset [1];
}
lfMember, *PlfMember, **PPlfMember;

#define lfMember_ sizeof (lfMember)

// -----------------------------------------------------------------

typedef struct _lfBClass        // base class field
{
    WORD         leaf;      // LF_BCLASS
    CV_fldattr_t attr;
    DWORD        index;
    BYTE         offset [1];
}
lfBClass, *PlfBClass, **PPlfBClass;

#define lfBClass_ sizeof (lfBClass)

// -----------------------------------------------------------------

typedef struct _lfVFuncTab      // virtual function table pointer
{
    WORD  leaf;             // LF_VFUNCTAB
    WORD  pad0;             // padding
    DWORD type;             // VFT pointer type
}
lfVFuncTab, *PlfVFuncTab, **PPlfVFuncTab;

#define lfVFuncTab_ sizeof (lfVFuncTab)

// -----------------------------------------------------------------

typedef struct _lfOneMethod     // non-overloaded method
{
    WORD         leaf;      // LF_ONEMETHOD
    CV_fldattr_t attr;
    DWORD        index;
    DWORD        vbaseoff [1]; // VFT base offset, if present
}
lfOneMethod, *PlfOneMethod, **PPlfOneMethod;

#define lfOneMethod_ sizeof (lfOneMethod)

// -----------------------------------------------------------------

typedef struct _lfMethod        // overloaded method list
{
    WORD  leaf;             // LF_METHOD
    WORD  count;            // number of occurrences
    DWORD mList;            // LF_METHODLIST descriptor index
    BYTE  Name [1];
}
lfMethod, *PlfMethod, **PPlfMethod;

#define lfMethod_ sizeof (lfMethod)

// -----------------------------------------------------------------

typedef struct _lfNestType      // nested type definition
{
    WORD  leaf;             // LF_NESTTYPE
    WORD  pad0;
    DWORD index;
    BYTE  Name [1];
}
lfNestType, *PlfNestType, **PPlfNestType;

#define lfNestType_ sizeof (lfNestType)

// -----------------------------------------------------------------

typedef union _lfSubRecord
{
    /*000*/ WORD        leaf;      // LF_*
    /*000*/ lfEnumerate Enumerate; // LF_ENUMERATE
    /*000*/ lfMember    Member;    // LF_MEMBER
    /*000*/ lfBClass    BClass;    // LF_BCLASS
    /*000*/ lfVFuncTab  VFuncTab;  // LF_VFUNCTAB
    /*000*/ lfOneMethod OneMethod; // LF_ONEMETHOD
    /*000*/ lfMethod    Method;    // LF_METHOD
    /*000*/ lfNestType  NestType;  // LF_NESTTYPE
}
lfSubRecord, *PlfSubRecord, **PPlfSubRecord;

#define lfSubRecord_ sizeof (lfSubRecord)

// -----------------------------------------------------------------

#pragma pack(1)
typedef struct _lfFieldList     // struct/union/enum members
{
    /*000*/ WORD        leaf;       // LF_FIELDLIST
    /*002*/ lfSubRecord SubRecord;
    /*002*/ }
lfFieldList, *PlfFieldList, **PPlfFieldList;
#pragma pack()

#define lfFieldList_ sizeof (lfFieldList)

// -----------------------------------------------------------------

typedef union _lfRecord
{
    /*000*/ WORD        leaf;      // LF_*
    /*000*/ lfArray     Array;     // LF_ARRAY
    /*000*/ lfBitfield  Bitfield;  // LF_BITFIELD
    /*000*/ lfClass     Class;     // LF_CLASS
    /*000*/ lfStructure Structure; // LF_STRUCTURE
    /*000*/ lfUnion     Union;     // LF_UNION
    /*000*/ lfEnum      Enum;      // LF_ENUM
    /*000*/ lfPointer   Pointer;   // LF_POINTER
    /*000*/ lfProc      Proc;      // LF_PROCEDURE
    /*000*/ lfMFunc     MFunc;     // LF_MFUNCTION
    /*000*/ lfArgList   ArgList;   // LF_ARGLIST
    /*000*/ lfVTShape   VTShape;   // LF_VTSHAPE
    /*000*/ lfFieldList FieldList; // LF_FIELDLIST
}
lfRecord, *PlfRecord, **PPlfRecord;

#define lfRecord_ sizeof (lfRecord)

// -----------------------------------------------------------------

#pragma pack ()

// =================================================================
// DBI STRUCTURES (STREAM #3)
//
// Debug info (DBI) stream begins with header and followed by several
// sections whose sizes are defined in header.
// =================================================================

// -----------------------------------------------------------------
// Debug info stream header v.4.0.

#pragma pack (1)
typedef struct tagDBI_STREAM_HEADER_400
{
    WORD wGSStreamNumber;           // Global symbol stream number
    WORD wPSStreamNumber;           // Global symobol publics stream number
    WORD wSymStreamNumber;          // Symbol stream number
    WORD wReserved;                 // Reserved
    LONG cbModuleInfo;              // Size of module info section
    LONG cbSectionContrib;          // Size of section contribution
    LONG cbSectionMap;              // Size of section map
    LONG cbFileInfo;                // Size of file info section
}
DBI_STREAM_HEADER_400, *PDBI_STREAM_HEADER_400, **PPDBI_STREAM_HEADER_400;

// -----------------------------------------------------------------
// Debug info stream header v.7.0.

#define DBI_HDR_SIGNATURE 0xFFFFFFFF  // Header signature
#define DBI_HDR_VERSION   19990903    // Header version

typedef struct tagDBI_STREAM_HEADER_700
{
    DWORD dwSignature;             // Signature (DBI_HDR_SIGNATURE)
    DWORD dwVersion;               // Header version (DBI_HDR_VERSION)
    DWORD dwAge;                   // Age
    WORD  wGSStreamNumber;         // Global symbol stream number
    WORD  wVerPdbDllMajMin;        // Version of PDB DLL ???
    WORD  wPSStreamNumber;         // Global symobol publics stream number
    WORD  wVerPdbDllBuild;         // Version of PDB DLL ???
    union
    {
        WORD  wSymStreamNumber;      // Symbol stream number
        DWORD dwReserved;
    };
    LONG  cbModuleInfo;            // Size of module info section
    LONG  cbSectionContrib;        // Size of section contribution
    LONG  cbSectionMap;            // Size of section map
    LONG  cbFileInfo;              // Size of file info section
    LONG  cbTSMap;                 // Thread storage map ???
    DWORD iMFC;                    // ???
    LONG  cbDbgHdr;                // Size of debug header ???
    LONG  cbECInfo;                // ???
    WORD  wFlags;                  // Flags
    WORD  wMachine;                // Architecture enumeration
    DWORD dwReserved2[1];          // Reserved
}
DBI_STREAM_HEADER_700, *PDBI_STREAM_HEADER_700, **PPDBI_STREAM_HEADER_700;

// -----------------------------------------------------------------
// Edit and continue info

struct EditAndContinueInfo
{
    DWORD niSrcFile; // Source file index
    DWORD niPdbFile; // PDB file index???
};

// -----------------------------------------------------------------
// Section contribution
//
// Section contribution is a block of code belonging to a segment (section) that was contrubuted
// by a compiland module. Section contribution information is used to find which compiland module
// has contributed the code located at some address, and then to determine corresponding
// source file name and line number for the code.

typedef struct tagDBI_SECTION_CCONTRIB_40
{
    WORD  wSectionIndex;          // Section index
    WORD  wReserved1;             // Reserved
    LONG  lOffset;                // Offset
    LONG  cbSize;                 // Size of contribution
    DWORD dwCharacteristics;      // Characterisitcs
    WORD  wModuleIndex;           // Module index
    WORD  wReserved2;             // Reserved
}
DBI_SECTION_CONTRIB_40, *PDBI_SECTION_CONTRIB_40, **PPDBI_SECTION_CONTRIB_40;

typedef struct tagDBI_SECTION_CCONTRIB
{
    DBI_SECTION_CONTRIB_40  SectionContrib40;  // Section contrib v4.0
    DWORD dwDataCrc;                       // Data CRC value
    DWORD dwRelocCrc;                      // CRC of reloc ???
}
DBI_SECTION_CONTRIB, *PDBI_SECTION_CONTRIB, **PPDBI_SECTION_CONTRIB;

// -----------------------------------------------------------------
// Module info
//
// Info related to a compiland module (module name, stream number and so on).

typedef struct tagDBI_MODULE_INFO
{
    DWORD  dwModulePtr;      // Module pointer
    DBI_SECTION_CONTRIB SectionContrib;   // This module's first section contribution
    struct
    {
        WORD fWritten   : 1;   // TRUE if module has been written since DBI opened
        WORD fECEnabled : 1;   // Edit and continue info enabled
        WORD Reserved   : 6;   // Reserved
        WORD iTSM       : 8;   //
    };
    WORD   wStreamNumber;    // Stream number of module debug info (symbols, lines, fpo), or snNil
    LONG   cbSymbols;        // Size of local symbols debug info in stream sn
    LONG   cbLines;          // Size of line number debug info in stream sn
    LONG   cbC13Lines;       //
    WORD   ifileMac;         // Size of frame pointer opt debug info in stream sn
    WORD   wReserved;        // Currently not used
    LONG   mpifileichFile;   // array [0..ifileMac) of offsets into dbi.bufFilenames
    EditAndContinueInfo ecInfo; // Edit and continue info
    BYTE   uchName[1];       // Module name zero-terminated string followed by obj file name zero-terminated string.
}
DBI_MODULE_INFO, *PDBI_MODULE_INFO, **PPDBI_MODULE_INFO;

#pragma pack(1)
struct DBI_ECINFO_HEADER
{
    DWORD dwSignature;  // Signature 0xFEEFFEEF UTF-8???
    DWORD dwUnknown1;   // Count of something
    DWORD cbNames;      // Size of names
};
#pragma pack()

// =================================================================
// FPO STRUCTURES
// =================================================================

#pragma pack (1)

// -----------------------------------------------------------------
// Frame pointer omission (FPO) Record

#ifndef _WIN32

typedef struct __FPO_DATA
{
    DWORD ulOffStart;
    DWORD cbProcSize;
    DWORD cdwLocals;
    WORD  cdwParams;
    struct
    {
        WORD cbProlog : 8;
        WORD cbRegs   : 3;
        WORD fHasSEH  : 1;
        WORD fUseBP   : 1;
        WORD reserved : 1;
        WORD cbFrame  : 2;
    };
}
_FPO_DATA, *P_FPO_DATA, **PP_FPO_DATA;

#endif //!_WIN32

// -----------------------------------------------------------------

#pragma pack ()

// =================================================================
// PSGSI STRUCTURES
// =================================================================

#pragma pack (1)

// -----------------------------------------------------------------
// This subsection contains the globally compacted public symbols from the sstPublics. The format
// of the table is a header specifying the symbol and address hash functions, the length of the
// symbol information, the length of the symbol hash function data, and the length of address hash
// function data. This is followed by symbol information, which is followed by the symbol hash
// tables, and then followed by the address hash tables.

typedef struct _PSGSIHDR
{
    LONG  cbSymHash;       // Count or number of bytes in the symbol hash table.
    LONG  cbAddrMap;       // Count or number of bytes in the address hashing table.
    DWORD dwThunkCount;    // Count of thunks
    LONG  cbSizeOfThunk;   // Size of thunk
    WORD  wThunkTableSectionIndex; // Index of a thunk table section
    WORD  wReserved;         // Reserved
    LONG  lThunkTableOffset; // Offset of thunk table
    DWORD dwSectionCount;  // Section count
}
PSGSIHDR, *PPSGSIHDR, **PPPSGSIHDR;

// -----------------------------------------------------------------
// Global symbols
//
// This subsection contains globally compacted symbols. The format of the table is a header
// specifying the symbol and address hash functions, the length of the symbol information, the
// length of the symbol hash function data, and the length of address hash function data. This is
// followed by the symbol information, which followed by the symbol hash tables, and then
// followed by the address hash tables.

#pragma pack(1)
typedef struct tagGSI_STREAM_HEADER
{
    DWORD dwSignature;        // Signature
    DWORD dwVersion;          // Version of the header
    DWORD dwHashTableSize;    // Size of the hash table
    DWORD dwBucketTableSize;  // Size of the hash buckets table
    // Hash table follows this header.
    // Hash buckets table follows the hash table.
}
GSI_STREAM_HEADER, *PGSI_STREAM_HEADER, **PPGSI_STREAM_HEADER;
#pragma pack()

#pragma pack(1)
struct GSI_HASH_RECORD
{
    DWORD dwSymOffset;        //!< Hash or offset ???
    DWORD dwRefCount;         //!< Ref count
};
#pragma pack()



// -----------------------------------------------------------------

#pragma pack ()

// =================================================================
// SYMBOL RECORDS
//
// Describes the symbols in the object file. The record for each symbol
// contains the symbol name, the symbol address and other information needed to describe the
// symbol.
// =================================================================

#pragma pack (1)

// -----------------------------------------------------------------

typedef enum _CV_PUBSYMFLAGS_e
{
    cvpsfNone     = 0x00000000,
    cvpsfCode     = 0x00000001,
    cvpsfFunction = 0x00000002,
    cvpsfManaged  = 0x00000004,
    cvpsfMSIL     = 0x00000008,
}
CV_PUBSYMFLAGS_e, *PCV_PUBSYMFLAGS_e, **PPCV_PUBSYMFLAGS_e;

// -----------------------------------------------------------------

typedef union _CV_GENERIC_FLAG
{
    /*000.0*/ WORD cstyle  :  1;
    /*000.1*/ WORD rsclean :  1;
    /*000.2*/ WORD unused  : 14;
    /*002*/ }
CV_GENERIC_FLAG, *PCV_GENERIC_FLAG, **PPCV_GENERIC_FLAG;

#define CV_GENERIC_FLAG_ sizeof (CV_GENERIC_FLAG)

// -----------------------------------------------------------------

typedef union _CV_PUBSYMFLAGS
{
    /*000*/ DWORD grfFlags; // CV_PUBSYMFLAGS_e
    /*000*/ struct
        /*000*/     {
            /*000.0*/   DWORD fCode     :  1;
            /*000.1*/   DWORD fFunction :  1;
            /*000.2*/   DWORD fManaged  :  1;
            /*000.3*/   DWORD fMSIL     :  1;
            /*000.4*/   DWORD reserved  : 28;
            /*004*/     };
    /*004*/ }
CV_PUBSYMFLAGS, *PCV_PUBSYMFLAGS, **PPCV_PUBSYMFLAGS;

#define CV_PUBSYMFLAGS_ sizeof (CV_PUBSYMFLAGS)

// -----------------------------------------------------------------
// Flag definition used in the S_LPROC32 symbol record

union CV_PROCFLAGS
{
    BYTE bAll;
    BYTE grfAll;
    struct
    {
        BYTE CV_PFLAG_NOFPO      : 1;  // True if function has frame pointer omitted.
        BYTE CV_PFLAG_INT        : 1;  // True if function is interrupt routine.
        BYTE CV_PFLAG_FAR        : 1;  // True if function performs far return.
        BYTE CV_PFLAG_NEVER      : 1;  // True if function never returns.
        BYTE CV_PFLAG_NOTREACHED : 1;  //
        BYTE CV_PFLAG_CUST_CALL  : 1;  //
        BYTE CV_PFLAG_NOINLINE   : 1;  //
        BYTE unused              : 1;  //
    };
};

// -----------------------------------------------------------------

typedef struct _CV_LVARFLAGS
{
    /*000.0*/ WORD fIsParam   :  1;
    /*000.1*/ WORD fAddrTaken :  1;
    /*000.2*/ WORD fCompGenx  :  1;
    /*000.3*/ WORD unused     : 13;
    /*002*/ }
CV_LVARFLAGS, *PCV_LVARFLAGS, **PPCV_LVARFLAGS;

#define CV_LVARFLAGS_ sizeof (CV_LVARFLAGS)

// -----------------------------------------------------------------

typedef struct _CV_lvar_attr
{
    /*000*/ DWORD        off;
    /*004*/ WORD         seg;
    /*006*/ CV_LVARFLAGS flags;
    /*008*/ }
CV_lvar_attr, *PCV_lvar_attr, **PPCV_lvar_attr;

#define CV_lvar_attr_ sizeof (CV_lvar_attr)

// -----------------------------------------------------------------
// Alignment
//
// This symbol is inserted by the CVPACK utility to pad symbol space so that the next symbol will
// not cross a page boundary.

struct SYM_ALIGN
{
    WORD wSymLength;      // Record length.
    WORD wSymType;        // Record type (S_ALIGN).
    // Unused data follow. Use the length field that precedes every symbol record
    // to skip this record. The pad bytes must be zero.
};

//------------------------------------------------------------------
// Symbol header structure (OMF header).

#pragma pack(1)
typedef struct _OMF_HEADER
{
    WORD wRecordSize; // Length of the record in bytes, not including this member.
    WORD wRecordType; // Symbol type.
}
OMF_HEADER, *POMF_HEADER, **PPOMF_HEADER;
#pragma pack()

// -----------------------------------------------------------------
// Annotation
//
// Specifies an annotated location in program code.

struct SYM_ANNOTATION
{
    WORD  wSymLength;   // Record length.
    WORD  wSymType;     // Record type (S_ANNOTATION).
    DWORD dwOffset;     // Offset part of symbol address.
    WORD  wSegment;     // Segment part of symbol address.
    WORD  cbName;       // Length of symbol name.
    BYTE  uchName[1];   // Name of this symbol.
};

// -----------------------------------------------------------------
// Many register symbol
//
// This record is used to specify that a symbol is stored in a set of registers.

struct SYM_ATTRMANYREG
{
    WORD         wSymLength;      // Record length
    WORD         wSymType;        // Record type (S_MANYREG)
    DWORD        dwTypeIndex;     // Symbol type index
    CV_lvar_attr Attr;            //
    BYTE         uchCount;        // Count of the register enumerations that follow.
    BYTE         uchRegisters[1]; // List of registers in which the symbol is stored. The registers are listed
    // high order register first.
    // Name of the symbol follows.
};

struct SYM_ATTRMANYREG2
{
    WORD         wSymLength;      // Record length
    WORD         wSymType;        // Record type
    DWORD        dwTypeIndex;     // Symbol type index
    CV_lvar_attr Attr;            //
    WORD         wCount;          // Count of the register enumerations that follow.
    WORD         wRegisters[1];   // List of registers in which the symbol is stored. The registers are listed
    // high order register first.
    // Name of the symbol follows.
};

// -----------------------------------------------------------------

typedef struct _ATTRREGREL
{
    /*000*/ WORD         reclen;   // record length
    /*002*/ WORD         rectyp;   // record type
    /*004*/ DWORD        off;
    /*008*/ DWORD        typind;
    /*00C*/ WORD         reg;
    /*00E*/ CV_lvar_attr attr;
    /*016*/ BYTE         name [1];
    /*017*/ }
ATTRREGREL, *PATTRREGREL, **PPATTRREGREL;

#define ATTRREGREL_ sizeof (ATTRREGREL)

// -----------------------------------------------------------------

typedef struct _ATTRREGSYM
{
    /*000*/ WORD         reclen;   // record length
    /*002*/ WORD         rectyp;   // record type
    /*004*/ DWORD        typind;
    /*008*/ CV_lvar_attr attr;
    /*010*/ WORD         reg;
    /*012*/ BYTE         name [1];
    /*013*/ }
ATTRREGSYM, *PATTRREGSYM, **PPATTRREGSYM;

#define ATTRREGSYM_ sizeof (ATTRREGSYM)

// -----------------------------------------------------------------

typedef struct _ATTRSLOTSYM
{
    /*000*/ WORD         reclen;   // record length
    /*002*/ WORD         rectyp;   // record type
    /*004*/ DWORD        iSlot;
    /*008*/ DWORD        typind;
    /*00C*/ CV_lvar_attr attr;
    /*014*/ BYTE         name [1];
    /*015*/ }
ATTRSLOTSYM, *PATTRSLOTSYM, **PPATTRSLOTSYM;

#define ATTRSLOTSYM_ sizeof (ATTRSLOTSYM)

// -----------------------------------------------------------------
// Block start
//
// This symbol specifies the start of an inner block of lexically scoped symbols. The lexical scope
// is terminated by a matching S_END symbol.

struct SYM_BLOCK
{
    WORD  wSymLength;   // Record length
    WORD  wSymType;     // Record type (S_BLOCK)
    DWORD pParent;      // Offset of lexical scope parent symbol.
    DWORD pEnd;         // Offset of lexical scope end.
};

struct SYM_BLOCK16
{
    WORD  wSymLength;   // Record length
    WORD  wSymType;     // Record type (S_BLOCK16)
    DWORD pParent;      // Offset of lexical scope parent symbol.
    DWORD pEnd;         // Offset of lexical scope end.
    WORD  wLength;      // Length in bytes of the scope of this block.
    WORD  wOffset;      // Offset portion of the segmented procedure address.
